extends Node

# Глобальный скрипт входа в игру, точнее ее среду. Тут можно обьявлять константы, переменные и вызывать функции которые нужны при запуске.
# А ище, тут будет храниться информация о игре тоесть версия, и тд.


const FORBIDDEN_CHARACTERS: Array[String] = [
	"\\", "/", ":", "*", "?", "\"", "<", ">", "|", "#", "%", "{", "}",
	"^", "~", "[", "]", ";", ",", ".", "(", ")", "@", "$", "&", "!", "+"
]

const USER_PATH: String = "user://"

func _ready() -> void:
	DirUtil.create_folders(USER_PATH, ["saves", "user_config", "screenshot"])
